results/MySQL/IvyBridge/events/dyni-oltp.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            993776
        write:                           0
        other:                           141968
        total:                           1135744
    transactions:                        70984  (1183.02 per sec.)
    queries:                             1135744 (18928.35 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0008s
    total number of events:              70984

Latency (ms):
         min:                                  0.72
         avg:                                  0.84
         max:                                  2.10
         95th percentile:                      0.97
         sum:                              59927.04

Threads fairness:
    events (avg/stddev):           70984.0000/0.00
    execution time (avg/stddev):   59.9270/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1796928
        write:                           0
        other:                           256704
        total:                           2053632
    transactions:                        128352 (2139.12 per sec.)
    queries:                             2053632 (34226.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0007s
    total number of events:              128352

Latency (ms):
         min:                                  0.71
         avg:                                  0.93
         max:                                  2.18
         95th percentile:                      1.03
         sum:                             119818.81

Threads fairness:
    events (avg/stddev):           64176.0000/361.00
    execution time (avg/stddev):   59.9094/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3341072
        write:                           0
        other:                           477296
        total:                           3818368
    transactions:                        238648 (3977.30 per sec.)
    queries:                             3818368 (63636.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0011s
    total number of events:              238648

Latency (ms):
         min:                                  0.87
         avg:                                  1.00
         max:                                  5.96
         95th percentile:                      1.04
         sum:                             239599.09

Threads fairness:
    events (avg/stddev):           59662.0000/124.43
    execution time (avg/stddev):   59.8998/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4332944
        write:                           0
        other:                           618992
        total:                           4951936
    transactions:                        309496 (5158.03 per sec.)
    queries:                             4951936 (82528.49 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0013s
    total number of events:              309496

Latency (ms):
         min:                                  0.98
         avg:                                  1.55
         max:                                 29.82
         95th percentile:                      1.64
         sum:                             479475.09

Threads fairness:
    events (avg/stddev):           38687.0000/137.61
    execution time (avg/stddev):   59.9344/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4297104
        write:                           0
        other:                           613872
        total:                           4910976
    transactions:                        306936 (5115.28 per sec.)
    queries:                             4910976 (81844.48 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0024s
    total number of events:              306936

Latency (ms):
         min:                                  0.98
         avg:                                  3.13
         max:                                 39.79
         95th percentile:                      3.30
         sum:                             959477.73

Threads fairness:
    events (avg/stddev):           19183.5000/65.49
    execution time (avg/stddev):   59.9674/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4214770
        write:                           0
        other:                           602110
        total:                           4816880
    transactions:                        301055 (5017.08 per sec.)
    queries:                             4816880 (80273.28 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0047s
    total number of events:              301055

Latency (ms):
         min:                                  1.27
         avg:                                  6.38
         max:                                177.22
         95th percentile:                      6.79
         sum:                            1919356.90

Threads fairness:
    events (avg/stddev):           9407.9688/54.02
    execution time (avg/stddev):   59.9799/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            4112514
        write:                           0
        other:                           587502
        total:                           4700016
    transactions:                        293751 (4895.03 per sec.)
    queries:                             4700016 (78320.46 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0087s
    total number of events:              293751

Latency (ms):
         min:                                  0.98
         avg:                                 13.07
         max:                               7175.14
         95th percentile:                     13.70
         sum:                            3839566.83

Threads fairness:
    events (avg/stddev):           4589.8594/169.15
    execution time (avg/stddev):   59.9932/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3930024
        write:                           0
        other:                           561432
        total:                           4491456
    transactions:                        280716 (4676.93 per sec.)
    queries:                             4491456 (74830.83 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0201s
    total number of events:              280716

Latency (ms):
         min:                                  0.96
         avg:                                 27.36
         max:                              14294.77
         95th percentile:                     30.81
         sum:                            7680692.61

Threads fairness:
    events (avg/stddev):           2193.0938/336.67
    execution time (avg/stddev):   60.0054/0.01